{
  "Longbeards": {
    "rules": [
      {
        "phase": "COMBAT",
        "type": "REROLL",
        "value": "save",
        "name": "Gromril Shields",
        "text": "This unit can create a shield wall instead of running or charging in its turn. If it does so, re-roll all failed save rolls for the unit in the combat phase until its next movement phase."
      },
      {
        "phase": "BATTLESHOCK",
        "type": "OTHER",
        "name": "<i>I thought Dwarfs were made of sterner stuff!</i>",
        "text": "Roll a dice each time a <span class='keyword'>Dispossessed</span> model from your army flees whilst within 8\" of this unit; on a 5 or more that model stands firm under the Longbeards’ stern gaze and does not flee."
      },
      {
        "phase": "HERO",
        "type": "OTHER",
        "name": "<i>Who does this beardling think he is?</i>",
        "text": "<span class='keyword'>Dispossessed</span> Heroes from your army within 8\" of this unit in the hero phase can use their command abilities even if they are not your general."
      },
      {
        "phase": "COMBAT",
        "type": "REROLL",
        "value": "to wound",
        "name": "<i>Goblins are weedier these days!</i>",
        "text": "You can re-roll wound rolls of 1 for <span class='keyword'>Dispossessed</span> models from your army that are within 8\" of this unit when they attack in the combat phase."
      }
    ]
  },
  "Dwarf Warriors": {
    "rules": [
      {
        "phase": "COMBAT",
        "type": "REROLL",
        "value": "save",
        "name": "Dwarf Shields",
        "text": "A unit equipped with Dwarf Shields can create a shield wall instead of running or charging in its turn. If it does so, re-roll all failed save rolls for the unit in the combat phase until its next movement phase."
      },
      {
        "phase": "COMBAT",
        "type": "REROLL",
        "value": "to wound",
        "name": "Resolute In Defence",
        "text": "You can re-roll failed wound rolls of 1 when attacking with a Dwarf Warrior in your opponent’s combat phase. You can instead re-roll all failed wound rolls for a Dwarf Warrior if its unit has 20 or more models when it attacks in your opponent’s combat phase."
      },
      {
        "phase": "HERO",
        "type": "SAVE",
        "value": "5+ save",
        "name": "Runic Icon",
        "text": "Roll a dice if a spell affects a unit with any Runic Icons. On a roll of a 5 or a 6, that spell has no affect on the unit (but it will affect other units normally)."
      },
      {
        "phase": "BATTLESHOCK",
        "type": "OTHER",
        "value": "",
        "name": "Clan Banner",
        "text": "If you fail a battleshock test for a unit that has any Clan Banners, halve the number of models that flee (rounding up)."
      }
    ]
  },
  "Quarrellers": {
    "rules": [
      {
        "phase": "COMBAT",
        "type": "REROLL",
        "value": "save",
        "name": "Dwarf Bucklers",
        "text": "If a unit is equipped with Dwarf Bucklers, it can create a shield wall instead of running or charging in its turn. If it does so, re-roll all failed save rolls for the unit in the combat phase until its next movement phase."
      },
      {
        "phase": "SHOOTING",
        "type": "BUFF",
        "value": "attack",
        "name": "Volley Fire",
        "text": " Quarrellers can shoot twice if their unit has 20 or more models and there are no enemy models within 3\"."
      },
      {
        "phase": "HERO",
        "type": "SAVE",
        "value": "5+ save",
        "name": "Runic Icon",
        "text": "Roll a dice if a spell affects a unit with any Runic Icons. On a roll of a 5 or a 6, that spell has no affect on the unit (but it will affect other units normally)."
      },
      {
        "phase": "BATTLESHOCK",
        "type": "OTHER",
        "value": "",
        "name": "Clan Banner",
        "text": "If you fail a battleshock test for a unit that has any Clan Banners, halve the number of models that flee (rounding up)."
      }
    ]
  },
  "Slayers": {
    "rules": [
      {
        "phase": "BATTLESHOCK",
        "type": "OTHER",
        "name": "Seeking a Glorious Death",
        "text": "You do not need to take battleshock tests for a unit of Slayers if they can see an enemy <span class='keyword'>Monster</span>."
      },
      {
        "phase": "COMBAT",
        "type": "OTHER",
        "name": "Deathblow",
        "text": "If a Slayer is slain in the combat phase, roll a dice before it is removed. On a roll of 4 or more, you can inflict 1 mortal wound on the enemy unit that struck the fatal blow after all of its attacks have been made."
      },
      {
        "phase": "COMBAT",
        "type": "BUFF",
        "value": "to wound",
        "name": "Slayer Oath",
        "text": "You can add 1 to any wound rolls for a Slayer if the target of the attack has more than 1 Wound."
      },
      {
        "phase": "COMBAT",
        "type": "BUFF",
        "value": "attack",
        "name": "The Slayer King",
        "text": "Slayers make an extra attack with their Slayer Axes whilst their unit is within 8\" of <span class='keyword'>Ungrim Ironfist the Slayer King.</span>"
      }
    ]
  },
  "Hammerers": {
    "rules": [
      {
        "phase": "BATTLESHOCK",
        "type": "OTHER",
        "value": "",
        "name": "Kingsguard ",
        "text": "You do not need to take battleshock tests for this unit if it is within 16\" of a <span class='keyword'>Dispossessed Hero</span> from your army in the battleshock phase."
      }
    ]
  },
  "Ironbreakers": {
    "rules": [
      {
        "phase": "SHOOTING",
        "type": "",
        "value": "",
        "name": "Cinderblast Bomb",
        "text": "Once per battle, a model with a Cinderblast Bomb can throw it in your shooting phase. To do so, pick a unit within 6\" and roll a dice; on a 2 or more, that unit suffers D3 mortal wounds."
      },
      {
        "phase": "COMBAT",
        "type": "REROLL",
        "value": "save",
        "name": "Gromril Shields",
        "text": "This unit can create a shield wall instead of running or charging in its turn. If it does so, re-roll all failed save rolls for the unit in the combat phase until its next movement phase."
      },
      {
        "phase": "",
        "type": "OTHER",
        "value": "",
        "name": "Forge-proven Gromril Armour",
        "text": "When you make save rolls for this unit, ignore the enemy’s Rend characteristic unless it is -2 or better."
      }
    ]
  },
  "Flame Cannon": {
    "rules": [
      {
        "phase": "SHOOTING",
        "type": "OTHER",
        "value": "D6 wounds",
        "name": "Rune of Burning",
        "text": "When an Engineer stamps this rune onto a Flame Cannon its next shot burns with the fury of a raging forge. A Flame Burst inflicts D6 mortal wounds on the target instead of D3 if there is a <span class='keyword'>Duardin Engineer</span> from your army within 1\" of the war machine (it will also inflict an additional D6 mortal wounds instead of D3 if the unit is set ablaze, as described in Flame Burst)."
      }
    ]
  },
  "Organ Gun": {
    "rules": [
      {
        "phase": "SHOOTING",
        "type": "REROLL",
        "value": "jam",
        "name": "Rune of Forging",
        "text": "These runes are used by Engineers to ensure that their war machine stays true and does not misfire in the heat of battle. You can re-roll the dice rolled to see if an Organ Gun jams if there is a <span class='keyword'>Duardin Engineer</span> from your army within 1\" of the war machine."
      }
    ]
  },
  "Cannon": {
    "rules": [
      {
        "phase": "SHOOTING",
        "type": "REROLL",
        "value": "damage",
        "name": "Explosive Shells",
        "text": "You can re-roll the damage inflicted by a Cannon Shell if the target unit has 10 or more models."
      },
      {
        "phase": "SHOOTING",
        "type": "REROLL",
        "value": "to hit",
        "name": "Rune of Accuracy",
        "text": "Engineers can inscribe Cannon Shells with magical runes to guide them to their target. You can re-roll failed hit rolls when firing a Cannon Shell if there is a <span class='keyword'>Duardin Engineer</span> from your army within 1\" of the war machine."
      }
    ]
  },
  "Runelord": {
    "rules": [
      {
        "phase": "HERO",
        "type": "OTHER",
        "value": "unbind",
        "name": "Runes of Spellbreaking",
        "text": "A Runelord can attempt to unbind one enemy spell in the enemy hero phase as if he were a wizard. You can add 2 to any unbinding rolls for a Runelord."
      },
      {
        "phase": "HERO",
        "type": "OTHER",
        "value": "",
        "name": "Rune Lore",
        "text": "In your hero phase a Runelord can pray to the Ancestor Gods to imbue his allies’ weapons and armour with power. If he does so, pick a <span class='keyword'>Dispossessed</span> unit within 16\" (pick a unit within 24\" instead if the Runelord is within 8\" of <span class='keyword'>Thorek Ironbrow</span>), select a power and roll a dice; on a 1 the Runelord has failed and nothing happens. On a roll of 2 or more the runes hammered into his allies’ wargear glow white-hot with rune magic and the power takes effect. Ancestral Shield: Until your next hero phase, you can roll a dice whenever a model in this unit suffers a wound or a mortal wound. On a 6, that wound or mortal wound is ignored. Forgefire: Until your next hero phase, increase the Rend characteristics of the unit’s weapons by 1 (i.e. ‘-’ becomes -1, -1 becomes -2 and so on)."
      }
    ]
  },
  "Unforged": {
    "rules": [
      {
        "phase": "COMBAT",
        "type": "REROLL",
        "value": "to hit",
        "name": "Runic Axes",
        "text": "The Unforged launches a deadly flurry of blows. You can re-roll all hit rolls of 1 for an Unforged."
      },
      {
        "phase": "COMBAT",
        "type": "OTHER",
        "value": "",
        "name": "Epic Deathblow",
        "text": "If an Unforged is slain in the combat phase, roll a dice before it is removed. On a roll of 4 or more, you can inflict D3 mortal wounds on the enemy unit that struck the fatal blow (inflict D6 mortal wounds instead if a <span class='keyword'>Chaos</span> model struck the final blow)."
      },
      {
        "phase": "COMBAT",
        "type": "BUFF",
        "value": "",
        "name": "Nemesis",
        "text": "Attacks made by an Unforged inflict double Damage against <span class='keyword'>Chaos</span> units."
      },
      {
        "phase": "COMBAT",
        "type": "BUFF",
        "value": "to wound",
        "name": "The Bigger They are...",
        "text": "You can add 1 to any wound rolls for an Unforged if the target of the attack has a Wounds characteristic of more than 1."
      }
    ]
  },
  "Warden King": {
    "rules": [
      {
        "type": "REROLL",
        "value": "save",
        "name": "Ancestor Shield",
        "text": "You can re-roll all failed saves for a Warden King."
      },
      {
        "phase": "HERO",
        "type": "OTHER",
        "value": "",
        "name": "Oath Stone",
        "text": "In the hero phase, a Warden King can stand atop his oath stone to increase the resolve of his followers. If he does so, he cannot move until his next hero phase, but all <span class='keyword'>Dispossessed</span> units from your army within 18\" in the battleshock phase may use the Warden King’s Bravery instead of their own."
      },
      {
        "phase": "HERO",
        "type": "BUFF",
        "value": "to wound",
        "name": "Ancestral Grudge",
        "text": "If a Warden King uses this ability, pick one enemy unit within 16\". Until your next hero phase, you can add 1 to wound rolls for all attacks made by Dispossessed models that target that unit.",
        "commandAbility": "true"
      }
    ]
  },
  "Gyrocopters": {
    "rules": [
      {
        "phase": "MOVEMENT",
        "type": "OTHER",
        "value": "",
        "name": "Guild Bombs",
        "text": "Once per battle, a unit of Gyrocopters can drop their Guild Bombs. To do so, pick one enemy unit that the Gyrocopters flew over in the movement phase. Then, roll two dice for each Gyrocopter in the unit; each time you roll a 4 or more, the unit being bombed suffers a mortal wound."
      }
    ]
  },
  "Dwarf Engineer": {
    "rules": [
      {
        "phase": "HERO",
        "type": "OTHER",
        "value": "heal wound",
        "name": "Engineer",
        "text": "In your hero phase, a Dwarf Engineer can repair a single <span class='keyword'>War Machine</span> within 4\". That model repairs 1 wound."
      }
    ]
  },
  "Grudgebound War Throng": {
    "rules": [
      {
        "type": "REROLL",
        "value": "1 to hit",
        "name": "Ancient Grudges",
        "text": "Reroll all hit rolls of 1"
      },      
      {
        "phase": "BATTLESHOCK",
        "type": "OTHER",
        "value": "",
        "name": "Stubborn to the End",
        "text": "If you roll a 1, 2 or 3 for a battleshock test, the unit passes."
      }
    ]
  },
    "Dispossessed Clan Throng": {
    "rules": [
      {
        "type": "REROLL",
        "value": "1 to hit",
        "name": "Ancient Grudges",
        "text": "Reroll all hit rolls of 1"
      },      
      {
        "phase": "BATTLESHOCK",
        "type": "OTHER",
        "value": "",
        "name": "Stubborn to the End",
        "text": "If you roll a 1, 2 or 3 for a battleshock test, the unit passes."
      }
    ]
  }
}